name: "paddle_ocr_gpu_batched"
backend: "python"
max_batch_size: 96

dynamic_batching {
  preferred_batch_size: [ 16, 32, 64, 96 ]
  max_queue_delay_microseconds: 10000
}

input [
  {
    name: "INPUT1"
    data_type: TYPE_UINT8
    dims: [ -1, -1, 3 ]
    optional: true
  }
]
output [
  {
    name: "OUTPUT0"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]

instance_group [
  {
    kind: KIND_CPU
    count: 1
#    gpus: [0]
  }
]
